12_rpa/README.md

# Table of Contents

-   [What will you learn?](#orgdf45124)
-   [What is RPA](#org46085aa)
    -   [Summary](#orgc199f87)
    -   [There is (much) more](#org83f042c)
-   [How is it done in practice?](#orgebedeef)
    -   [Signavio Workflow Accelerator](#org57683e4)
    -   [Integromat](#org0a778b1)
    -   [Bubble / AppGyver](#orga3304a0)
-   [References](#org24edd2f)



<a id="orgdf45124"></a>

# What will you learn?

-   What is Robotic Process Automation?
-   How is it done in practice?


<a id="org46085aa"></a>

# What is RPA

-   "[What is Robotic process automation?](https://youtu.be/aZDaNVh3l0k)" 7 min (IBM, 2021)


<a id="orgc199f87"></a>

## Summary

1.  Automate repeated, tedious tasks
2.  E.g. Optical Character Recognition (OCR) for data extraction
3.  "Intelligent" tools / machine learning (model building)
4.  Low code / no code
5.  Concurrency
6.  RPA as a Service (plug-and-play)
7.  Collaboration potential


<a id="org83f042c"></a>

## There is (much) more

-   Dependencies are crucial
-   More common: workflow integration
-   Create agents through app combination
-   Combine with process modeling (BPMN)
-   Vendors: SAP Signavio, Integromat/Celonis, [UIPath](https://www.uipath.com/), [IFTTT](https://ifttt.com/)
-   No-code focus: bubble, SAP AppGyver


<a id="orgebedeef"></a>

# How is it done in practice?

-   Signavio demonstration ([Signavio, 2021](#orgf881dfa))
-   Integromat example ([Integromat, 2016](#org35f82e0))


<a id="org57683e4"></a>

## Signavio Workflow Accelerator

-   Works in concert with BPMN process modeling
-   Do it yourself in editor.signavio.com (enterprise license)


<a id="org0a778b1"></a>

## Integromat

-   Automated workflow with defined APIs
-   Do it yourself (free) at integromat.com


<a id="orga3304a0"></a>

## Bubble / AppGyver

I'm not a friend of low code/no code approaches - for a bunch of
reasons. However, many developers (of web apps) seem to think
differently, or perhaps it's just clever marketing. No matter:
`bubble.io` seems like a good place to look at some use cases.

Here is a [gallery of no-code apps built with Bubble](https://bubble.io/showcase).

AppGyver was recently acquired by SAP (like Signavio) - the
Composer Pro platform is free. [Here is some onboarding help.](https://docs.appgyver.com/appgyver-academy)

I have no used either of these platforms yet but I'd like to
contrast coding and no-coding programs and projects for a future
research and/or teaching project.


<a id="org24edd2f"></a>

# References

IBM Technology (Mar 19, 2021). What is RPA (Robotic Process
Automation)? [video] [URL: youtu.be/aZDaNVh3l0k](https://youtu.be/aZDaNVh3l0k)

<a id="orgf881dfa"></a> SAP Signavio Process Governance (2021) [website]. URL:
[signavio.com/products/process-governance/](https://www.signavio.com/products/process-governance/)

<a id="org35f82e0"></a> Integromat (Aug 11, 2016). What is Integromat? [video]. [URL:
youtu.be/61HQ\_DWoFr8](https://youtu.be/61HQ_DWoFr8)

